{"arithmetic": 8, "subarrays": 26, "find": 119, "all": 70, "numbers": 48, "disappeared": 1, "in": 238, "an": 57, "array": 195, "combination": 6, "sum": 149, "iii": 24, "reverse": 21, "bits": 7, "minimum": 196, "value": 32, "to": 292, "get": 12, "positive": 8, "step": 2, "by": 54, "largest": 44, "local": 2, "values": 12, "a": 274, "matrix": 44, "duplicates": 8, "k-th": 5, "smallest": 47, "lexicographical": 4, "order": 15, "reward": 1, "top": 5, "k": 75, "students": 8, "jump": 10, "game": 39, "mice": 1, "and": 86, "cheese": 1, "wiggle": 2, "subsequence": 32, "move": 7, "pieces": 3, "obtain": 3, "string": 130, "repeated": 7, "substring": 32, "pattern": 5, "design": 24, "ordered": 2, "stream": 6, "sort": 24, "integers": 25, "the": 222, "power": 6, "words": 27, "fibonacci": 5, "number": 282, "path": 35, "crossing": 2, "maximum": 182, "absolute": 10, "of": 554, "any": 5, "subarray": 33, "winner": 5, "on": 23, "tic": 1, "tac": 1, "toe": 1, "happy": 4, "strings": 39, "length": 26, "n": 13, "subset": 6, "xor": 18, "totals": 1, "difference": 30, "between": 28, "ones": 11, "zeros": 6, "row": 12, "column": 8, "angle": 1, "hands": 2, "clock": 2, "next": 9, "greater": 14, "element": 29, "score": 33, "from": 60, "removing": 8, "stones": 7, "ways": 30, "where": 6, "square": 14, "is": 26, "equal": 53, "product": 29, "two": 77, "copy": 1, "list": 39, "with": 158, "random": 8, "pointer": 1, "deletions": 5, "make": 79, "beautiful": 10, "fizz": 2, "buzz": 2, "multithreaded": 1, "matching": 7, "subsequences": 17, "greatest": 8, "common": 17, "divisor": 5, "increasing": 20, "decreasing": 2, "integer": 28, "(atoi)": 1, "coins": 5, "you": 14, "can": 30, "vi": 2, "rotate": 5, "image": 4, "filter": 2, "elements": 35, "sets": 2, "non-overlapping": 10, "line": 5, "segments": 5, "fraction": 3, "addition": 3, "subtraction": 2, "sequential": 2, "digits": 21, "remove": 30, "occurrences": 6, "covered": 4, "intervals": 8, "moves": 13, "seat": 4, "everyone": 1, "closest": 15, "prime": 9, "range": 23, "put": 1, "marbles": 1, "bags": 2, "shortest": 18, "superstring": 1, "distinct": 16, "echo": 1, "substrings": 25, "after": 51, "operations": 41, "rank": 6, "teams": 3, "votes": 1, "price": 7, "at": 22, "given": 27, "date": 3, "be": 13, "removed": 2, "sorted": 35, "stay": 1, "same": 16, "place": 3, "some": 2, "steps": 9, "count": 103, "bitwise-or": 1, "subsets": 8, "hourglass": 1, "divide": 10, "into": 19, "groups": 14, "size": 12, "point": 5, "rectangles": 4, "koko": 1, "eating": 1, "bananas": 1, "shifting": 2, "letters": 6, "ii": 92, "set": 7, "binary": 118, "representation": 3, "submatrices": 4, "water": 8, "jug": 1, "problem": 2, "n-ary": 4, "tree": 106, "postorder": 4, "traversal": 18, "maximize": 16, "greatness": 1, "global": 1, "inversions": 1, "merge": 15, "pair": 7, "chain": 2, "transform": 4, "chessboard": 4, "palindrome": 26, "average": 14, "waiting": 1, "time": 47, "balls": 6, "each": 21, "box": 5, "valid": 36, "perfect": 4, "data": 6, "as": 6, "disjoint": 2, "swap": 9, "for": 24, "longest": 58, "character": 9, "super": 5, "palindromes": 1, "zuma": 1, "check": 40, "if": 39, "object": 3, "instance": 1, "class": 1, "paths": 17, "whose": 4, "divisible": 14, "consecutive": 25, "sequence": 11, "modify": 1, "graph": 16, "edge": 3, "weights": 1, "even": 17, "odd": 14, "indices": 5, "independently": 1, "heaters": 1, "third": 1, "pseudo-palindromic": 1, "empty": 2, "add": 17, "one": 21, "verifying": 1, "alien": 1, "dictionary": 6, "cost": 26, "cut": 2, "stick": 1, "unguarded": 1, "cells": 8, "grid": 27, "widest": 1, "vertical": 3, "area": 10, "points": 17, "containing": 5, "no": 5, "triangular": 1, "increment": 3, "minimize": 15, "total": 14, "stone": 11, "viii": 1, "statistics": 1, "large": 4, "sample": 1, "non": 1, "negative": 4, "capitalize": 1, "title": 2, "floored": 1, "pairs": 39, "zeroes": 5, "full": 5, "capacity": 2, "rocks": 1, "arrays": 22, "rotated": 6, "vertices": 1, "reach": 11, "nodes": 32, "human": 1, "traffic": 1, "stadium": 1, "destroy": 1, "targets": 1, "build": 7, "permutation": 13, "spiral": 4, "construct": 12, "good": 21, "matchsticks": 1, "flood": 2, "fill": 2, "buddy": 1, "employees": 7, "missing": 7, "information": 2, "nice": 5, "special": 11, "circular": 11, "outermost": 1, "parentheses": 16, "vowel": 5, "ranges": 4, "left": 5, "right": 7, "differences": 3, "multiple": 4, "adjacent": 10, "lr": 1, "flip": 6, "match": 4, "preorder": 8, "alphabet": 2, "board": 3, "floors": 3, "without": 4, "domino": 3, "rotations": 2, "lowest": 4, "ancestor": 5, "search": 30, "similar": 5, "items": 5, "a's": 1, "appears": 1, "before": 3, "b's": 1, "possible": 8, "root": 5, "only": 2, "pow(x,": 1, "n)": 1, "costs": 1, "partition": 15, "such": 1, "that": 25, "plus": 2, "sign": 3, "earliest": 2, "day": 5, "bloom": 2, "harmonious": 1, "degree": 2, "connected": 2, "trio": 1, "compare": 3, "version": 2, "inorder": 3, "patching": 1, "within": 6, "edits": 1, "are": 11, "three": 22, "select": 1, "buildings": 1, "insert": 5, "delete": 17, "getrandom": 2, "o(1)": 2, "k-mirror": 1, "lower": 4, "case": 3, "great": 2, "poor": 1, "pigs": 1, "node": 19, "bst": 11, "when": 2, "network": 6, "becomes": 1, "idle": 1, "mini": 1, "parser": 3, "query": 8, "kth": 19, "trimmed": 1, "queens": 1, "attack": 1, "king": 1, "change": 6, "final": 3, "expression": 8, "first": 10, "parts": 3, "dining": 1, "philosophers": 1, "fixed": 2, "type": 3, "word": 27, "using": 8, "typewriter": 1, "median": 4, "target": 25, "rectangle": 12, "invalid": 3, "rotting": 1, "oranges": 2, "compression": 2, "magnetic": 1, "force": 1, "k-increasing": 1, "actors": 1, "directors": 1, "who": 5, "cooperated": 1, "least": 10, "times": 5, "index": 9, "vowels": 6, "bag": 2, "tokens": 1, "student": 3, "attendance": 2, "record": 2, "latest": 5, "login": 1, "2020": 1, "triangulation": 1, "polygon": 2, "level": 6, "brick": 1, "wall": 1, "cyclically": 1, "rotating": 2, "calculate": 5, "money": 3, "leetcode": 1, "bank": 5, "middle": 4, "linked": 25, "divisors": 4, "eat": 3, "your": 3, "favorite": 3, "candy": 4, "day?": 1, "connectivity": 1, "threshold": 6, "generate": 4, "circle": 6, "people": 10, "zero": 15, "subtracting": 1, "amounts": 1, "flipping": 3, "nth": 5, "magical": 2, "complete": 6, "components": 3, "islands": 3, "reaching": 1, "house": 5, "robber": 4, "2": 3, "keys": 3, "keyboard": 2, "letter": 11, "equalize": 1, "frequency": 11, "senior": 1, "citizens": 1, "bitwise": 9, "or": 20, "fair": 4, "robot": 6, "return": 3, "origin": 2, "climbing": 2, "stairs": 2, "sender": 1, "respecting": 1, "dependencies": 1, "suggestions": 1, "system": 9, "optimal": 2, "division": 2, "parenthesis": 1, "transactions": 4, "exam": 3, "room": 2, "balanced": 7, "handling": 1, "queries": 17, "update": 1, "increments": 2, "form": 9, "elimination": 2, "decode": 8, "hamming": 3, "distance": 20, "consistent": 1, "square-free": 1, "probability": 4, "boxes": 5, "having": 1, "create": 7, "descriptions": 1, "sums": 9, "swaps": 11, "strong": 2, "password": 2, "checker": 3, "detonate": 1, "bombs": 1, "trips": 3, "daily": 2, "temperatures": 1, "step-by-step": 1, "directions": 1, "another": 5, "browser": 1, "history": 1, "impossible": 2, "contaminated": 1, "bit": 4, "flips": 6, "convert": 17, "different": 9, "characters": 29, "colored": 3, "exchange": 1, "seats": 1, "split": 17, "found": 2, "sentences": 2, "long": 2, "pressed": 1, "name": 1, "uncrossed": 1, "lines": 3, "semi-ordered": 1, "triangle": 7, "patients": 1, "condition": 2, "intersection": 5, "cycle": 5, "managers": 2, "5": 3, "direct": 1, "reports": 1, "max": 18, "unique": 25, "russian": 1, "doll": 1, "envelopes": 1, "players": 4, "trainers": 1, "coin": 2, "reachable": 3, "restrictions": 1, "positions": 2, "insertion": 3, "progression": 1, "best": 11, "position": 7, "service": 1, "centre": 1, "implement": 5, "magic": 4, "reorder": 4, "candies": 6, "determine": 6, "color": 4, "n-queens": 2, "i": 15, "win": 3, "laser": 1, "beams": 1, "spellchecker": 1, "strictly": 5, "lemonade": 1, "even-valued": 1, "grandparent": 1, "reformat": 4, "diagonal": 4, "reduce": 6, "x": 5, "palindromic": 12, "alphabetical": 1, "continuous": 6, "predict": 1, "array-form": 1, "hire": 2, "workers": 2, "doing": 1, "homework": 1, "splitting": 3, "smooth": 1, "descent": 1, "periods": 1, "stock": 9, "rearrange": 8, "prefix": 13, "132": 1, "movement": 1, "robots": 2, "department": 4, "highest": 11, "salary": 7, "bad": 2, "constrained": 1, "1-bit": 1, "2-bit": 1, "trailing": 3, "zigzag": 5, "labelled": 1, "open": 2, "lock": 1, "factorial": 3, "larger": 1, "than": 16, "task": 3, "scheduler": 2, "gap": 2, "transpose": 2, "digit": 16, "last": 11, "moment": 1, "ants": 1, "fall": 2, "out": 3, "plank": 1, "prefixes": 2, "reducing": 1, "dishes": 1, "group": 10, "m": 3, "obstacle": 2, "removal": 3, "corner": 1, "anagram": 3, "they": 1, "belong": 1, "bricks": 1, "falling": 4, "hit": 1, "twitter": 1, "tuple": 1, "visit": 2, "cell": 1, "teach": 1, "subtrees": 2, "cities": 2, "1": 4, "required": 2, "sudoku": 2, "solver": 1, "bounded": 3, "partitioning": 5, "iv": 12, "evaluate": 4, "bracket": 1, "sales": 4, "person": 3, "process": 3, "tasks": 6, "servers": 3, "roman": 2, "gcd": 2, "deleting": 3, "ends": 1, "boolean": 2, "summary": 2, "exactly": 3, "comparisons": 1, "uncommon": 3, "break": 5, "repeating": 7, "needed": 3, "buy": 9, "tickets": 3, "restore": 3, "finding": 4, "users": 4, "active": 1, "minutes": 1, "fruits": 2, "harvested": 1, "most": 21, "multiply": 1, "coordinate": 3, "quality": 3, "reduction": 1, "jewels": 1, "their": 3, "location": 1, "display": 1, "table": 5, "food": 4, "orders": 4, "restaurant": 2, "categories": 1, "subtree": 6, "deepest": 3, "not": 5, "neighbors": 3, "key": 4, "length-3": 1, "mode": 1, "equals": 4, "children": 3, "ipo": 1, "rounds": 3, "have": 5, "played": 1, "lexicographically": 7, "its": 3, "apply": 5, "discount": 4, "prices": 2, "equivalent": 5, "garden": 3, "perimeter": 3, "collect": 4, "enough": 1, "apples": 3, "cooking": 1, "sightseeing": 1, "item": 1, "altitude": 1, "erect": 1, "fence": 1, "events": 4, "rle": 1, "iterator": 5, "excellent": 1, "boomerangs": 1, "ascending": 2, "atm": 1, "machine": 2, "ugly": 4, "star": 2, "knight": 3, "parity": 3, "fancy": 2, "replace": 11, "earnings": 1, "taxi": 1, "event": 1, "emitter": 1, "k-sum": 2, "getting": 1, "fresh": 1, "donuts": 1, "up": 3, "columns": 6, "rows": 4, "catch": 1, "bus": 4, "anagrams": 4, "play": 2, "analysis": 6, "happiness": 1, "single-threaded": 1, "cpu": 1, "end": 1, "tweet": 1, "counts": 3, "per": 2, "escape": 3, "spreading": 1, "fire": 1, "inverse": 1, "car": 4, "fleet": 2, "hexadecimal": 1, "piece": 1, "cake": 1, "horizontal": 1, "cuts": 2, "pancake": 1, "sorting": 3, "trees": 9, "factors": 4, "loop": 1, "single": 6, "radius": 1, "averages": 3, "shift": 1, "2d": 8, "sequentially": 1, "ordinal": 1, "tracker": 2, "sliding": 4, "puzzle": 3, "removals": 4, "washing": 1, "machines": 1, "rand10()": 1, "rand7()": 1, "unequal": 2, "stars": 1, "it": 2, "fish": 1, "replacement": 3, "longer": 1, "contiguous": 2, "queue": 6, "interchangeable": 1, "employee": 7, "worked": 1, "separate": 2, "routes": 3, "mountain": 5, "fluctuation": 1, "booking": 1, "concert": 1, "occurs": 1, "sentence": 9, "boomerang": 1, "destination": 4, "city": 7, "stack": 6, "queues": 1, "deletion": 1, "leaves": 4, "punishment": 1, "structure": 2, "bulls": 1, "cows": 1, "overlapping": 2, "distribute": 5, "phone": 3, "chunk": 1, "occurrence": 2, "pens": 1, "pencils": 1, "uni-value": 1, "segment": 2, "visited": 3, "ascii": 1, "days": 9, "spent": 2, "together": 2, "basic": 3, "calculator": 6, "reversing": 1, "double": 2, "reversal": 1, "truncate": 1, "allocated": 1, "brace": 1, "expansion": 1, "arrange": 1, "edit": 1, "trie": 1, "(prefix": 1, "tree)": 1, "detect": 4, "capital": 3, "function": 10, "composition": 1, "print": 6, "foobar": 1, "alternately": 2, "block": 1, "descending": 1, "less": 5, "tic-tac-toe": 1, "state": 1, "varying": 1, "xored": 2, "wonderful": 1, "english": 3, "flowers": 2, "cat": 2, "mouse": 2, "pick": 4, "weight": 3, "airplane": 1, "assignment": 1, "execute": 2, "cancellable": 2, "delay": 2, "symmetric": 1, "minimums": 1, "crawler": 1, "log": 2, "folder": 1, "moving": 2, "until": 2, "sell": 7, "prefix-aligned": 1, "-": 7, "input": 2, "whether": 2, "almost": 1, "units": 2, "truck": 1, "restricted": 2, "asterisks": 1, "email": 1, "addresses": 2, "triplets": 6, "triplet": 2, "4sum": 2, "market": 1, "pow": 1, "goal": 1, "interpretation": 1, "every": 2, "piles": 1, "team": 3, "conflicts": 1, "popular": 1, "video": 2, "creator": 1, "frog": 3, "manager": 3, "company": 2, "bowling": 1, "bonus": 2, "pass": 2, "pillow": 1, "dice": 2, "roll": 2, "simulation": 3, "fascinating": 1, "freedom": 1, "trail": 1, "big": 1, "countries": 1, "asteroid": 1, "collision": 1, "cutting": 1, "pizza": 2, "min": 4, "connect": 2, "blacklist": 1, "delayed": 1, "arrival": 1, "friend": 2, "requests": 4, "rabbits": 1, "forest": 2, "four": 3, "island": 4, "counting": 2, "alternating": 8, "colors": 4, "clumsy": 1, "restaurants": 1, "vegan-friendly,": 1, "operation": 5, "cards": 4, "diminishing-valued": 1, "quad": 1, "frequencies": 1, "penalty": 1, "shop": 2, "arrive": 3, "v": 2, "products": 7, "period": 2, "critical": 3, "repair": 1, "cars": 2, "wrapper": 1, "interval": 7, "rule": 1, "dinner": 1, "plate": 1, "stacks": 2, "investments": 1, "2016": 1, "concatenated": 2, "text": 2, "editor": 1, "duplicate": 12, "vertically": 1, "k-subarray": 1, "watched": 1, "videos": 1, "friends": 4, "has": 4, "execution": 1, "suffix": 3, "instructions": 3, "staying": 1, "chocolates": 2, "dna": 1, "sequences": 5, "contains": 5, "sufficient": 1, "thousand": 1, "separator": 1, "transformable": 1, "non-decreasing": 3, "gain/loss": 1, "formed": 2, "broken": 1, "insertions": 1, "balance": 2, "p": 1, "depth": 5, "primary": 1, "mutating": 1, "frequent": 6, "following": 1, "champagne": 1, "tower": 1, "arrangements": 1, "cherry": 2, "pickup": 3, "solution": 1, "equation": 3, "communicate": 1, "width": 3, "ramp": 1, "3": 2, "morse": 1, "code": 2, "well-performing": 1, "mk": 1, "tag": 1, "validator": 1, "homogenous": 1, "distances": 3, "base": 5, "7": 1, "over": 1, "diagonally": 1, "scores": 4, "second": 4, "parallel": 3, "courses": 2, "paint": 2, "\u00d7": 1, "performing": 2, "multiplication": 3, "variance": 1, "summing": 1, "music": 1, "playlists": 1, "lonely": 1, "solve": 1, "hashset": 1, "rating": 2, "disconnect": 2, "subtract": 1, "confirmation": 1, "rate": 1, "importance": 2, "relative": 2, "earn": 2, "my": 3, "calendar": 3, "twice": 2, "others": 1, "bitset": 1, "rungs": 1, "certain": 1, "rooms": 4, "subpath": 1, "polish": 1, "notation": 1, "trapping": 2, "rain": 2, "complement": 2, "emails": 2, "hashmap": 1, "k-concatenation": 1, "there": 3, "speed": 1, "shuffle": 4, "hand": 2, "straights": 1, "matches": 1, "tournament": 1, "deci-binary": 1, "reconstruct": 4, "2-row": 1, "lists": 6, "transformation": 1, "hello": 1, "world": 1, "recover": 3, "cousins": 2, "tromino": 1, "tiling": 2, "lengths": 1, "t": 1, "seconds": 1, "judgement": 1, "half": 1, "regular": 1, "surrounded": 1, "regions": 2, "cancellation": 1, "arranging": 1, "changes": 1, "weakest": 1, "height": 6, "stacking": 1, "cuboids": 1, "concatenation": 6, "n-repeated": 1, "2n": 1, "card": 1, "guess": 3, "higher": 2, "smaller": 3, "self": 4, "lattice": 1, "inside": 3, "diagonals": 1, "x-matrix": 1, "ideal": 2, "rolls": 2, "based": 3, "statements": 1, "secret": 2, "combinations": 3, "diameter": 1, "flatten": 4, "redundant": 2, "connection": 2, "arrows": 1, "burst": 2, "balloons": 3, "decoded": 1, "appear": 2, "built": 1, "k-similar": 1, "repetitions": 1, "gray": 1, "destroying": 1, "asteroids": 1, "prison": 1, "attended": 3, "hills": 1, "valleys": 1, "itinerary": 1, "cross": 2, "bridge": 2, "sideway": 1, "jumps": 2, "categorize": 1, "according": 2, "criteria": 1, "space": 2, "wasted": 2, "resizing": 1, "slices": 3, "masking": 1, "personal": 1, "topmost": 1, "leaf": 6, "squares": 6, "archery": 1, "competition": 3, "immutable": 2, "wear": 1, "hats": 1, "other": 1, "inserter": 1, "module": 1, "bipartite?": 1, "pseudo-critical": 1, "edges": 3, "spanning": 1, "call": 2, "custom": 2, "context": 1, "encode": 1, "tinyurl": 1, "beans": 1, "preimage": 1, "monotone": 2, "3n": 1, "shopping": 1, "offers": 1, "changing": 2, "tilt": 1, "wraparound": 1, "kind": 1, "deck": 1, "blocks": 2, "artifacts": 1, "extracted": 1, "eliminate": 1, "monsters": 1, "majority": 3, "skyline": 2, "negations": 1, "which": 2, "report": 2, "repeat": 1, "limit": 6, "permutations": 3, "di": 3, "24": 1, "original": 5, "leaf-similar": 1, "previous": 1, "boundary": 1, "compatibility": 1, "reconstruction": 1, "white": 2, "tiles": 2, "carpet": 1, "selling": 2, "ranked": 1, "twin": 1, "completing": 1, "recurring": 1, "decimal": 1, "cinema": 1, "allocation": 1, "lru": 1, "cache": 3, "turbulent": 1, "monthly": 1, "assign": 2, "cookies": 2, "appearing": 1, "more": 5, "25%": 1, "exist": 1, "ant": 1, "colony": 1, "conditions": 3, "streak": 1, "keep": 3, "fully": 1, "traversable": 1, "effort": 1, "diff": 1, "allowed": 1, "triples": 2, "roads": 2, "dessert": 1, "provinces": 1, "neither": 1, "nor": 1, "boring": 1, "movies": 1, "1's": 3, "places": 1, "away": 1, "uploaded": 1, "covering": 2, "ii:": 1, "validate": 4, "work": 3, "sessions": 1, "finish": 4, "cameras": 1, "percentage": 3, "isomorphic": 1, "fix": 1, "names": 2, "mutated": 1, "dates": 1, "pivot": 3, "rings": 1, "rods": 1, "squareful": 1, "applying": 2, "inform": 1, "running": 2, "computers": 1, "non-coprime": 1, "weak": 1, "eventual": 1, "safe": 2, "states": 1, "rearranged": 1, "increase": 1, "splitted": 1, "collecting": 1, "append": 2, "alert": 1, "key-card": 1, "hour": 1, "reservation": 1, "lcp": 1, "strongest": 1, "min-product": 1, "removable": 1, "except": 1, "tile": 1, "possibilities": 1, "key-value": 1, "store": 2, "pooling": 1, "reorganize": 1, "competitive": 1, "rational": 1, "window": 3, "vii": 2, "infinite": 1, "resultant": 1, "subrectangle": 1, "folders": 1, "travellers": 1, "meals": 1, "movie": 2, "connections": 1, "pruning": 1, "still": 1, "skill": 1, "file": 4, "divisibility": 2, "obtained": 3, "adding": 4, "beauty": 5, "richest": 2, "customer": 4, "wealth": 1, "burgers": 1, "waste": 1, "ingredients": 1, "k-beauty": 1, "amount": 4, "garbage": 1, "visiting": 2, "1d": 2, "peeking": 1, "erasure": 1, "homecoming": 1, "both": 1, "marking": 1, "supersequence": 1, "utf-8": 1, "validation": 1, "multiplying": 1, "nested": 3, "generator": 1, "tweets": 1, "verify": 1, "serialization": 1, "ip": 3, "counter": 2, "mutable": 1, "dota2": 1, "senate": 1, "coloring": 2, "method": 1, "chaining": 1, "entering": 1, "authentication": 1, "stickers": 1, "spell": 1, "container": 2, "houses": 2, "3sum": 3, "decrypt": 2, "mapping": 1, "atoms": 1, "write": 1, "memoize": 2, "satisfy": 2, "fingers": 1, "simple": 1, "wood": 1, "surface": 1, "3d": 2, "shapes": 2, "doubled": 2, "starting": 1, "01": 1, "differ": 1, "awesome": 1, "multilevel": 1, "doubly": 1, "additive": 1, "source": 1, "boats": 1, "save": 1, "legal": 1, "aware": 1, "parking": 1, "followers": 1, "will": 2, "ball": 1, "year": 2, "result": 2, "excel": 3, "sheet": 3, "minimal": 1, "gold": 1, "reinitialize": 1, "referee": 1, "chunks": 2, "replacements": 1, "battleships": 1, "ghosts": 1, "slowest": 1, "conflict": 1, "bigram": 1, "halve": 1, "replacing": 2, "calls": 2, "xor-beauty": 1, "building": 4, "parse": 1, "lisp": 1, "tastiness": 1, "basket": 1, "achievable": 1, "transfer": 1, "fuel": 1, "unsorted": 1, "texts": 1, "serialize": 2, "deserialize": 2, "account": 1, "meeting": 3, "?'s": 1, "avoid": 2, "additions": 1, "1s": 1, "strength": 2, "represent": 1, "chart": 1, "widths": 1, "n-th": 1, "tribonacci": 1, "pascal's": 2, "watering": 2, "plants": 2, "available": 1, "captures": 1, "rook": 1, "stops": 3, "allow": 1, "population": 1, "naming": 1, "remapping": 1, "dungeon": 1, "genetic": 3, "sector": 1, "track": 1, "been": 1, "marked": 1, "online": 3, "election": 1, "appropriate": 1, "ages": 1, "levels": 2, "abbreviating": 1, "poker": 1, "unable": 1, "lunch": 1, "e-mails": 1, "advantage": 1, "skiplist": 1, "hash": 1, "ranks": 1, "how": 1, "many": 1, "current": 1, "sleep": 1, "side": 3, "race": 2, "non-zero": 1, "coprimes": 1, "choose": 1, "variable": 1, "losers": 1, "budget": 2, "walking": 2, "course": 5, "schedule": 5, "center": 1, "checking": 1, "existence": 1, "limited": 2, "initial": 1, "energy": 1, "taps": 1, "describe": 1, "painting": 2, "extra": 1, "ancestors": 1, "directed": 2, "acyclic": 1, "infected": 1, "rotation": 2, "generated": 1, "sqrt(x)": 1, "sold": 1, "collisions": 2, "road": 1, "squared": 1, "map": 2, "difficulty": 1, "job": 2, "loud": 1, "rich": 1, "mysterious": 1, "malware": 2, "spread": 2, "packaging": 1, "include": 1, "plates": 1, "candles": 1, "teemo": 1, "attacking": 1, "subdomain": 1, "jumbled": 1, "b": 1, "c": 1, "overlap": 2, "growth": 1, "view": 1, "visible": 3, "close": 1, "but": 1, "did": 1, "arrangement": 3, "partitions": 2, "mirror": 1, "reflection": 1, "k-diff": 1, "placing": 1, "comments": 1, "egg": 2, "drop": 2, "eggs": 1, "semi-repetitive": 1, "id": 2, "identifier": 1, "parsing": 1, "factor": 2, "cheapest": 1, "flights": 1, "weeks": 1, "songs": 1, "durations": 1, "60": 1, "arguments": 1, "passed": 1, "neighboring": 1, "nesting": 3, "symbol": 1, "grammar": 1, "conversion": 1, "gardens": 1, "ransom": 1, "note": 1, "tallest": 1, "billboard": 1, "temperature": 2, "profit": 3, "assigning": 1, "obstacles": 1, "ice": 1, "cream": 1, "bars": 1, "unreachable": 1, "undirected": 1, "exists": 2, "encoded": 2, "files": 1, "o`one": 1, "illumination": 1, "traverse": 2, "deeply": 1, "home": 1, "through": 3, "push": 1, "dominoes": 1, "non-negative": 2, "verbal": 1, "performance": 1, "chalkboard": 1, "formation": 1, "aaa": 1, "bbb": 1, "k-group": 1, "soup": 1, "servings": 1, "chips": 1, "accounts": 1, "labels": 2, "powers": 2, "bulb": 2, "switcher": 2, "operators": 2, "express": 1, "front": 1, "back": 1, "tenth": 1, "enclaves": 1, "reveal": 1, "new": 1, "21": 1, "intersections": 1, "ambiguous": 1, "coordinates": 1, "promise": 1, "monotonic": 1, "bsts": 1, "nim": 1, "salaries": 1, "far": 1, "land": 2, "article": 1, "views": 1, "defuse": 1, "bomb": 1, "1-bordered": 1, "carpets": 1, "companies": 1, "summation": 1, "kids": 1, "corporate": 1, "flight": 1, "bookings": 1, "stitching": 1, "border": 1, "illegal": 1, "goods": 1, "traveled": 1, "prototype": 1, "unhappy": 1, "substitutions": 1, "wildcard": 1, "contest": 1, "darts": 1, "dartboard": 1, "grumpy": 1, "bookstore": 1, "owner": 1, "degrees": 1, "handled": 1, "smoother": 1, "combine": 1, "tables": 1, "appeal": 1, "invited": 1, "enemy": 1, "forts": 1, "captured": 1, "special-equivalent": 1, "fewest": 1, "similarity": 1, "defanging": 1, "address": 2, "ors": 1, "rearranging": 2, "primes": 1, "flower": 1, "planting": 1, "rope": 1, "colorful": 1, "ratio": 1, "stamping": 2, "peak": 4, "complex": 1, "operating": 1, "centennial": 1, "wheel": 1, "subdivided": 1, "clone": 2, "say": 1, "join": 1, "recyclable": 1, "low": 1, "fat": 1, "profitable": 2, "schemes": 1, "customers": 2, "never": 1, "sub-tree": 1, "label": 1, "solving": 2, "questions": 1, "brainpower": 1, "recent": 1, "refueling": 1, "placed": 1, "crossword": 1, "histogram": 1, "short": 1, "encoding": 1, "jobs": 1, "bipartition": 1, "observations": 1, "backspace": 1, "cycles": 1, "sub-arrays": 3, "maximal": 4, "fertile": 1, "pyramids": 1, "logical": 1, "grids": 1, "represented": 1, "quad-trees": 1, "completely": 1, "painted": 1, "numeric": 1, "life": 1, "cooldown": 1, "skips": 1, "toeplitz": 1, "invert": 1, "delivery": 2, "options": 1, "strange": 2, "printer": 2, "project": 1, "unoccupied": 1, "chair": 1, "k-length": 1, "farmland": 1, "deque": 1, "closed": 1, "submatrix": 1, "rearrangements": 1, "monkeys": 1, "coprime": 1, "populating": 2, "pointers": 2, "odds": 1, "scheduling": 2, "heroes": 1, "lead": 1, "baseball": 1, "distribution": 1, "reshape": 1, "making": 2, "take": 2, "incompatibility": 1, "gifts": 1, "pile": 1, "nearest": 2, "y": 1, "bottles": 1, "slanted": 1, "ciphertext": 1, "compete": 1, "camelcase": 1, "bounds": 1, "hidden": 2, "orderly": 1, "dot": 1, "3-digit": 1, "lucky": 2, "buckets": 1, "feed": 1, "hamsters": 1, "confusion": 1, "bottom": 1, "backlog": 1, "chosen": 1, "couples": 1, "holding": 1, "exclusive": 1, "functions": 2, "zero-filled": 1, "eaten": 1, "leads": 1, "partners": 1, "quadruplets": 2, "negabinary": 1, "straight": 1, "no-zero": 1, "examinations": 1, "reordered": 1, "identical": 1, "message": 2, "biggest": 2, "dividing": 1, "filling": 1, "bookcase": 1, "shelves": 1, "pacific": 1, "atlantic": 1, "flow": 1, "10": 1, "gcds": 1, "-2": 1, "corresponding": 1, "html": 1, "entity": 1, "furthest": 2, "hours": 1, "training": 1, "compact": 1, "mutation": 1, "univalued": 1, "cracking": 1, "mean": 1, "3-same-digit": 1, "k-distant": 1, "watch": 1, "week": 1, "immediate": 1, "slashes": 1, "concatenating": 2, "ladder": 2, "powered": 1, "multiples": 1, "memory": 2, "allocator": 1, "classes": 1, "satisfiability": 1, "equality": 1, "equations": 1, "incremental": 1, "leak": 1, "subjects": 1, "taught": 1, "teacher": 1, "trim": 1, "transaction": 1, "fee": 1, "redistribute": 1, "frogs": 1, "croaking": 1, "town": 1, "judge": 1, "complementary": 1, "deviation": 1, "representing": 1, "minesweeper": 1, "ix": 1, "satisfying": 1, "inequality": 1, "user": 1, "activity": 1, "past": 1, "30": 1, "exit": 1, "entrance": 1, "maze": 2, "corridor": 1, "sticks": 2, "underground": 1, "0": 1, "divisions": 1, "halves": 1, "alike": 1, "asynchronous": 1, "rising": 2, "mismatch": 1, "snapshot": 1, "pairings": 1, "non-increasing": 1, "delivering": 1, "storage": 1, "ports": 1, "swapping": 1, "cornered": 1, "lcm": 1, "swim": 1, "wizards": 1, "debounce": 1, "encrypt": 1, "chunked": 1, "decomposition": 1, "univalue": 1, "license": 1, "formatting": 1, "fruit": 1, "baskets": 1, "promises": 1, "bought": 1, "bouquets": 1, "numerically": 1, "cups": 1, "chalk": 1, "decompress": 1, "run-length": 1, "ship": 1, "packages": 1, "d": 1, "dialer": 1, "multiplicity": 1, "h-index": 2, "snakes": 1, "ladders": 1, "tour": 1, "configuration": 1, "buying": 1, "simplify": 1, "sub": 1, "recipes": 1, "supplies": 1, "scramble": 1, "minimized": 1, "distributed": 1, "completeness": 1, "earning": 1, "excluding": 1, "rhombus": 1, "span": 1, "component": 1, "math": 1, "goat": 1, "latin": 1, "contain": 1, "virus": 1, "spliced": 1, "decrease": 1, "sub-folders": 1, "filesystem": 1, "upper": 1, "simplified": 1, "fractions": 1, "allocate": 1, "mailboxes": 1, "lfu": 1, "taking": 1, "projection": 1, "codes": 1, "rental": 1, "distant": 1, "barcodes": 1, "69": 1, "interleaving": 1, "weighted": 1, "subgraph": 1, "recolors": 1, "black": 1, "paid": 1, "taxes": 1, "expressive": 1, "pangram": 1, "insufficient": 1, "justification": 1, "gas": 1, "station": 1, "fit": 1, "spaces": 2, "rob": 1, "throne": 1, "inheritance": 1, "h2o": 1, "successful": 1, "spells": 1, "potions": 1, "powerful": 1, "snail": 1, "pyramid": 1, "transition": 1, "losses": 1}